create_clock -period 15.000 -name CLK -waveform {0.000 7.500} -add [get_ports CLK]
set_input_delay -clock [get_clocks CLK] -min -add_delay 5.000 [get_ports {CURRENT_TEMP[*]}]
set_input_delay -clock [get_clocks CLK] -max -add_delay 10.000 [get_ports {CURRENT_TEMP[*]}]
set_input_delay -clock [get_clocks CLK] -min -add_delay 4.000 [get_ports {DESIRED_TEMP[*]}]
set_input_delay -clock [get_clocks CLK] -max -add_delay 7.000 [get_ports {DESIRED_TEMP[*]}]
set_input_delay -clock [get_clocks CLK] -min -add_delay 4.000 [get_ports COOL]
set_input_delay -clock [get_clocks CLK] -max -add_delay 7.000 [get_ports COOL]
set_input_delay -clock [get_clocks CLK] -min -add_delay 4.000 [get_ports DISPLAY_SELECT]
set_input_delay -clock [get_clocks CLK] -max -add_delay 5.000 [get_ports DISPLAY_SELECT]
set_input_delay -clock [get_clocks CLK] -min -add_delay 5.000 [get_ports HEAT]
set_input_delay -clock [get_clocks CLK] -max -add_delay 7.000 [get_ports HEAT]
set_input_delay -clock [get_clocks CLK] -min -add_delay 5.000 [get_ports RESET]
set_input_delay -clock [get_clocks CLK] -max -add_delay 8.000 [get_ports RESET]
set_output_delay -clock [get_clocks CLK] -min -add_delay -1.000 [get_ports {TEMP_DISPLAY[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 6.000 [get_ports {TEMP_DISPLAY[*]}]
set_output_delay -clock [get_clocks CLK] -max -add_delay 6.000 [get_ports AC_ON]
set_output_delay -clock [get_clocks CLK] -min -add_delay -1.000 [get_ports FURNACE_ON]
set_output_delay -clock [get_clocks CLK] -max -add_delay 6.000 [get_ports FURNACE_ON]

